group-reports/sharif/results/100G-disk-throughput-tuning-protocol-A/test-3.txt
read-randomly-test-job: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
read-randomly-test-job: Laying out IO file (1 file / 102400MiB)

read-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=72068: Sat Jul 15 13:06:43 2023
   read: IOPS=69.3k, BW=541MiB/s (568MB/s)(317GiB/600002msec)
    slat (usec): min=2, max=334978, avg=217.99, stdev=741.25
    clat (usec): min=210, max=986210, avg=3475.07, stdev=3279.39
     lat (usec): min=222, max=986214, avg=3693.27, stdev=3399.54
    clat percentiles (usec):
     |  1.00th=[  717],  5.00th=[ 1336], 10.00th=[ 1713], 20.00th=[ 2212],
     | 30.00th=[ 2573], 40.00th=[ 2900], 50.00th=[ 3228], 60.00th=[ 3589],
     | 70.00th=[ 3982], 80.00th=[ 4490], 90.00th=[ 5342], 95.00th=[ 6194],
     | 99.00th=[ 8717], 99.50th=[10028], 99.90th=[14353], 99.95th=[17171],
     | 99.99th=[76022]
   bw (  KiB/s): min=   80, max=42832, per=6.25%, avg=34645.97, stdev=4354.66, samples=19189
   iops        : min=   10, max= 5354, avg=4330.72, stdev=544.33, samples=19189
  lat (usec)   : 250=0.01%, 500=0.36%, 750=0.78%, 1000=1.32%
  lat (msec)   : 2=12.96%, 4=54.94%, 10=29.13%, 20=0.48%, 50=0.02%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.29%, sys=5.40%, ctx=23674294, majf=0, minf=660
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=41579669,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=541MiB/s (568MB/s), 541MiB/s-541MiB/s (568MB/s-568MB/s), io=317GiB (341GB), run=600002-600002msec

Disk stats (read/write):
    drbd1: ios=41570051/6, merge=0/0, ticks=64946782/8, in_queue=64946789, util=100.00%, aggrios=41579670/7, aggrmerge=0/0, aggrticks=64901535/8, aggrin_queue=64901543, aggrutil=100.00%
    dm-0: ios=41579670/7, merge=0/0, ticks=64901535/8, in_queue=64901543, util=100.00%, aggrios=41579667/7, aggrmerge=3/0, aggrticks=56140680/8, aggrin_queue=33508409, aggrutil=100.00%
  sde: ios=41579667/7, merge=3/0, ticks=56140680/8, in_queue=33508409, util=100.00%